SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/src/n32g430_spi.c
        /* Get the Mask for the Odd bit (SPI_I2SPREDIV[8]) register */
        i2sodd = (uint16_t)(i2sodd << 8);
    }
        /* Test if the divider is 1 or 0 or greater than 0xFF */
    if ((i2sdiv < 2) || (i2sdiv > 0xFF))
    {
        /* Set the default values */
        i2sdiv = 2;
        i2sodd = 0;
    }

    /* Write to SPIx I2SPREDIV register the computed value */
    SPIx->I2SPREDIV = (uint16_t)(i2sdiv | (uint16_t)(i2sodd | (SPIx->I2SPREDIV & I2S_MCLK_ENABLE)));
}


/**
*\*\name    I2S_CLKPOL_Config.
*\*\fun     Config the I2s CLKPOL.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   CLKPOL :
*\*\          - I2S_CLKPOL_LOW 
*\*\          - I2S_CLKPOL_HIGH
*\*\return  none
**/
void I2S_CLKPOL_Config(SPI_Module* SPIx, uint16_t CLKPOL)
{
    /* Clear SPI_I2SPREDIV CLKPOL bit */
    SPIx->I2SCFG &= I2S_CLKPOL_MASK;
    /* Set SPI_I2SPREDIV CLKPOL bit */
    SPIx->I2SCFG |= CLKPOL;
}


/**
*\*\name    SPI_I2S_Interrupts_Enable.
*\*\fun     Enable SPI interrupts.
*\*\param   SPIx :
*\*\          - SPI1    
*\*\          - SPI2       
*\*\param   spi_interrupt :
*\*\          - SPI_I2S_INT_TE    SPI_CTRL2
*\*\          - SPI_I2S_INT_RNE   SPI_CTRL2
*\*\          - SPI_I2S_INT_ERR   SPI_CTRL2
*\*\return  none
**/
void SPI_I2S_Interrupts_Enable(SPI_Module* SPIx, uint8_t spi_interrupt)
{
    /* Set the SPI_CTRL2 TEINTEN/RNEINTEN/ERRINTEN bit to enable SPI or I2S interrupts */
    SPIx->CTRL2 |= spi_interrupt;
}

/**
*\*\name    SPI_I2S_Interrupts_Disable.
*\*\fun     Disable SPI interrupts.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2             
*\*\param   spi_interrupt :
*\*\          - SPI_I2S_INT_TE    SPI_CTRL2
*\*\          - SPI_I2S_INT_RNE   SPI_CTRL2
*\*\          - SPI_I2S_INT_ERR   SPI_CTRL2
*\*\return  none
**/
void SPI_I2S_Interrupts_Disable(SPI_Module* SPIx, uint8_t spi_interrupt)
{
    /* Clean the SPI_CTRL2 TEINTEN/RNEINTEN/ERRINTEN bit to disable SPI or I2S interrupts */
    SPIx->CTRL2 &= (~spi_interrupt);
}


/**
*\*\name    SPI_I2S_DMA_Transfer_Enable.
*\*\fun     Enable SPI or I2S DMA transfer.
*\*\param   SPIx :
*\*\          - SPI1      
*\*\          - SPI2           
*\*\param   SPI_I2S_DMARequest :
*\*\          - SPI_I2S_DMA_TX
*\*\          - SPI_I2S_DMA_RX
*\*\return  none
**/
void SPI_I2S_DMA_Transfer_Enable(SPI_Module* SPIx, uint16_t SPI_I2S_DMARequest)
{
    /* Set the SPI_CTRL2 TDMAEN/RDMAEN bit to enable TX/RX DMA transfer */
    SPIx->CTRL2 |= SPI_I2S_DMARequest;
}


/**
*\*\name    SPI_I2S_DMA_Transfer_Disable.
*\*\fun     Disable SPI or I2S DMA transfer.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2          
*\*\param   SPI_I2S_DMARequest :
*\*\          - SPI_I2S_DMA_TX
*\*\          - SPI_I2S_DMA_RX
*\*\return  none
**/
void SPI_I2S_DMA_Transfer_Disable(SPI_Module* SPIx, uint16_t SPI_I2S_DMARequest)
{
    /* Clean the SPI_CTRL2 TDMAEN/RDMAEN bit to disable TX/RX DMA transfer */
    SPIx->CTRL2 &= (uint16_t)~SPI_I2S_DMARequest;
}


/**
*\*\name    SPI_I2S_Data_Transmit.
*\*\fun     Transmits a Data through the SPIx/I2Sx peripheral.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2             
*\*\param   Data           \* Data to be transmitted *\
*\*\return  none
**/
void SPI_I2S_Data_Transmit(SPI_Module* SPIx, uint16_t Data)
{
    /* Write in the SPI_DAT register the data to be sent */
    SPIx->DAT = Data;
}


/**
*\*\name    SPI_I2S_Data_Get.
*\*\fun     Get SPI/I2S data from SPI_DAT register.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2             
*\*\return  The data in the SPI_DAT register
**/
uint16_t SPI_I2S_Data_Get(SPI_Module* SPIx)
{
    /* Return the data in the SPI_DAT register */
    return SPIx->DAT;
}


/**
*\*\name    SPI_I2S_Flag_Status_Get.
*\*\fun     Get SPI/I2S flag status.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2             
*\*\param   spi_i2s_flag :
*\*\          - SPI_I2S_FLAG_TE
*\*\          - SPI_I2S_FLAG_RNE
*\*\          - SPI_I2S_FLAG_BUSY
*\*\          - SPI_I2S_FLAG_OVER
*\*\          - SPI_FLAG_MODERR
*\*\          - SPI_FLAG_CRCERR
*\*\          - I2S_FLAG_UNDER
*\*\          - I2S_FLAG_CHSIDE 
*\*\return  SET or RESET
**/
FlagStatus SPI_I2S_Flag_Status_Get(SPI_Module* SPIx, uint8_t spi_i2s_flag)
{
    return (((SPIx->STS & spi_i2s_flag) == spi_i2s_flag) ? SET : RESET);  
}

/**
*\*\name    SPI_I2S_Get_Flag_Status.
*\*\fun     Get SPI/I2S flag status.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2             
*\*\param   spi_i2s_flag :
*\*\          - SPI_I2S_INT_FLAG_RNE 
*\*\          - SPI_I2S_INT_FLAG_TE  
*\*\          - I2S_INT_FLAG_UNDER   
*\*\          - SPI_INT_FLAG_CRCERR  
*\*\          - SPI_INT_FLAG_MODERR  
*\*\          - SPI_I2S_INT_FLAG_OVER
*\*\          - SPI_I2S_INT_FLAG_ERR 
*\*\return  SET or RESET
**/

FlagStatus SPI_I2S_Interrupt_Flag_Status_Get(SPI_Module* SPIx, uint16_t spi_i2s_flag)
{
    /* Interrupt flag */
    switch (spi_i2s_flag)
    {
        case SPI_I2S_INT_FLAG_TE:
            if((SPIx->CTRL2 & SPI_I2S_INT_TE) == SPI_I2S_INT_TE && (SPIx->STS & SPI_I2S_INT_FLAG_TE) == SPI_I2S_INT_FLAG_TE)
            {
                return SET;
            }
            else
            {
                return RESET;
            }
        case SPI_I2S_INT_FLAG_RNE:
            if((SPIx->CTRL2 & SPI_I2S_INT_RNE) && (SPIx->STS & SPI_I2S_INT_FLAG_RNE))
            {
                return SET;
            }
            else
            {
                return RESET;
            }
        case SPI_I2S_INT_FLAG_ERR:
        case I2S_INT_FLAG_UNDER:    
        case SPI_INT_FLAG_CRCERR:   
        case SPI_INT_FLAG_MODERR:   
        case SPI_I2S_INT_FLAG_OVER:
            if((SPIx->CTRL2 & SPI_I2S_INT_ERR) && (SPIx->STS & spi_i2s_flag))
            {
                return SET;
            }
            else
            {
                return RESET;
            }
        default:
           return RESET;
    }
}


/**
*\*\name    SPI_I2S_Get_Flag_Status.
*\*\fun     Get SPI/I2S flag status.
*\*\param   SPIx :
*\*\          - SPI1       
*\*\          - SPI2            
*\*\param   spi_i2s_flag :
*\*\          - SPI_I2S_FLAG_OVER
*\*\          - SPI_FLAG_CRCERR
*\*\          - I2S_FLAG_UNDER     
*\*\return  none
**/
void SPI_I2S_Clear_Flag_Status(SPI_Module* SPIx, uint16_t spi_i2s_flag)
{
    volatile u8 temp_vlue;
    switch (spi_i2s_flag)
    {
      case SPI_FLAG_CRCERR:
            SPIx->STS &= (uint16_t)(~spi_i2s_flag);
        break;
      case I2S_FLAG_UNDER:
           temp_vlue = SPIx->STS;
        break;
      default:
        break;
    }
    if((spi_i2s_flag == SPI_FLAG_CRCERR) || (spi_i2s_flag == SPI_INT_FLAG_CRCERR))
    {
        /* Clear the selected SPI CRC Error (CRCERR) flag */
        SPIx->STS &= (uint16_t)(~spi_i2s_flag);
    }
    else if((spi_i2s_flag == I2S_FLAG_UNDER) || (spi_i2s_flag == I2S_INT_FLAG_UNDER))
    {
      temp_vlue = SPIx->STS;
    }
    else
    {
        /* read SPI_DAT and SPI_STS to Clear the Flag*/
        temp_vlue = SPIx->DAT;
        temp_vlue = SPIx->STS;
    }
}


